# 1) დაბეჭდეთ 0-დან 100-მდე ყველა რიცხვი. 
for ი in range(100):
    print(i)

# 2) დაბეჭდეთ 0-დან 100-ის ჩათვლით ყველა რიცხვი.
for i in range(101):
    print(i)

# 3) დაბეჭდეთ 10-დან 20-მდე ყველე რიცხვი
for i in range(10 , 20):
    print(i)
# 4) დაბეჭდეთ 100-დან 200-ის ჩათვლით ყოველი მე-5 რიცხვი
for i in range(100 , 200 , 5):
    print(i)
# 5) დაბეჭდეთ 10-დან 0-ის ჩათვლით ყველა რიცხვი
for i in range(10, -1, -1):
    print(i)
# 6) დაბეჭდეთ 1-დან 10-ის ჩათვლით ყველა რიცხვი.
num1 = 1
while num1 <= 10:
    print(num1)
    num1 += 1


# 7) დაბეჭდეთ 0-დან 100-ის ჩათვლით ყველა ლუწი რიცხვი
num2 = 1
while num2 <= 100:
    print(num2)
    num2 += 1


# 8) დაბეჭდეთ 10-დან 0-ის ჩათვლით ყველა რიცხვი
num3 = 10
while num3 >= 0:
    print(num3)
    num3 -= 1

    
