
# 1) დაატრიალეთ for ციკლი 0 დან 38 ის ჩათვლით და გამოიტანე თითოეული რიცხვი ტერმინალში 
# for i in range(39):
#     print(i)

# 2) დაატრილეთ for ციკლი 30 დან 40 მდე  და გამოიტანე თითოეული რიცხვი ტერმინალში 
# for b in range(30,40):
#     print(b)
 
# 3) დაატრიალეთ for ციკლი 12 იდან 120 მდე  და გამოიტანე თითოეული რიცხვი ტერმინალში 
# for i in range(12,120):
#     print(i)
# 4) დაატრიალეთ for ციკლი და გამოიტანეთ თქვენი სახელი 18 ჯერ ასევე გამოიტანეთ თქვენი ასაკიც,ერთ for ციკლში მოათავსეთ ორივე და ეგრე გააკეთეთ
# name = "giorgi"
# age = "16"
# for i in name , age:
#     print(i*18)
# 5) დაატრიალეთ for ციკლი 10 დან 100 მდე 3 step ის გამოტოვებით და გამოიტანეთ თითოეული რიცხვი ტერმინალში
# for i in range(10,100,3):
#    print(i)
 
# 6) ტერმინალში გამოიტანეთ თქვენი საყვარელი ხილის სახელი 30 ჯერ და თან დანომრეთ, მიიღეთ ქვემოთ მოცემულის ნაირი შედეგი
# name = "banana"
# for i in name:
#    print(name)

# 7) მომხმარებელს შემოატანინეთ მისი ასაკი 13 ჯერ გამოიყენე for loop
name1 = input(int("enter ur age"))
for i in name1:
    print( name1*2)
# # 8) გამოიტანეთ თქვენი სახელი 10 ჯერ while loop ის გამოყენებით
# num2 = 
# while num2 > 10:
#      print(num2)
# num2 += 1
# # 9) დაითვალეთ 0 დან 24 მდე გამოიყენეთ while loop
# num = 0
# while num <= 24:
#     print(num)
    # num += 1

# 10) იმუშაოვეთ ბევრი for და while loop ებზე მოიყვანეთ თქვენით მაგალითები სურვილისამებრ