# 1) შექმენით 5 ელემენტიანი სია, სადაც ჩაწერთ თქვენს საყვარელი მანქანების სახელს. ბოლოს გამოიტანეთ სიაში მყოფი პირველი და მესამე მნიშვნელობა.
arr = ["nissan gtr" , "ford mustang" , "porshe 911" , "lexus i5 5000t sport" , "porhe spyder"  ]
print([0],[2])
# 2) შექმენით რიცხვების სია, სადაც ჩაწერთ 0-დან 10-ის ჩათვლით ყველა ლუწ რიცხვს. ბოლოს გამოიტანეთ სიაში მყოფი მეორე და მეოთხე მნიშვნელობა.
arr1 = [ 2 ,  4 , 6 , 8 ,10]
print([1],[3])
# 3) შექმენით 5 ელემენტიანი სია და დაბეჭდეთ მისი მე-4 ელემენტი.
arr2 = [1 , 2 , 3 , 4 , 5]
print([3])
# 4) იგივე სიის მე-3 ინდექსზე მყოფი ელემენტი შეცვალეთ თქვენი სახელით და დაბეჭდეთ მთლიანი სია.
arr2 = [1 , 2 , 3 , 4 , 5]
arr2[2] = "giorgi"
print(arr2)
# 5) შექმენით 3 ელემენტიანი რიცხვების სია და დაბეჭდეთ პირველი და ბოლო ელემენტის ჯამი ინდექსების გამოყენებით
arr2 = [1 , 2 , 3 ]
print(arr2[0] + arr2[2])
# 6) შექმენით 7 ელემენტიანი სახელების სია და შეცვალეთ მასში 1-ლი და მე-5 ინდექსზე მყოფი ელემენტები სხვა ნებისმიერი სახელით. შემდეგ დაბეჭდეთ განახლებული სია.
names = ["Ana", "Nika", "Luka", "Mariam", "Saba", "Elene", "Dato"]

names[0] = "Gio"
names[4] = "Nino"

print(names)