# 1) კომენტარების სახით ახსენით რა არის for loop, როდის ვიყენებთ და რა დანიშნულება გააჩნია. ასევე გააკეთეთ მარტივი მაგალითი.
     #for loop არის ლუპი რომელიც არ მთავრდება სანამ პირობა მცდარი არ იქნება.

# 2) კომენტარების სახით ახსენით რა არის indendation და რა დანიშნულება აქვს.
     #4 სპეისი არის და დანიშნულება აქვს პითონი იგებს რომ ეს ბლოკი ეკუთვნის ერთ if ფუნქციას
 
# 3) for ციკლის მეშვეობით გამოიტანეთ რიცხვები 0-დან 67-მდე.
for number in range(0, 67):
    print(number)
# 4) for ციკლის მეშვეობით გამოიტანეთ რიცხვები 12-დან 87-მდე.
for number in range(12, 87):
    print(number)

# 5) for ციკლის მეშვეობით გამოიტანეთ რიცხვები 4-დან 98-მდე, ყოველი 2-ი ნაბიჯის გამოტოვებით.
for number in range(12, 87,2):
    print(number)

# 6) for ციკლის მეშვეობით გამოიტანეთ თქვენი სახელი 10-ჯერ.
for i in range(11):
    print("giorgi")

# 7) მომხმარებელს შემოატანინეთ input-ით რაიმე სიტყვა, თქვენი დავალებაა შეინახოთ ეს მნიშვნელობა ცვლადში და დაბეჭდით ამ სიტყვაში შემადგენელი ყველა ასო for ციკლის მეშვეობოთ.
    name = input("ur name")
    for i in range(1):
        print(name)

# 8) მომხმარებელს შემოატანინეთ input-ით რაიმე რიცხვი, თქვენი დავალებაა შეინახოთ ეს მნიშვნელობა ცვლადში და for ციკლის გაკეთებისას ეს ცვლადი გადაცეთ ფინალურ მნიშვნელობად.
number = int(input("enter ur number "))

for i in range(number):
      print(i)